Repository: repperille/zonemaster-cli
Catalog: share/*.po
Languages: es

source: Warning: setting locale category LC_MESSAGES to {locale} failed -- is it installed on this system?
es: Advertencia: fallo en definir la categoría de localización LC_MESSAGES como {locale} (¿está instalada en este sistema?)

source: Warning: setting locale category LC_CTYPE to {locale} failed -- is it installed on this system?
es: Advertencia: fallo en definir la categoría de localización LC_CTYPE como {locale} (¿está instalada en este sistema?)

source: Warning: deprecated --encoding, simply remove it from your usage.
es: Advertencia: --encoding está obsoleto, puede eliminarlo de las opciones.

source: Error: --json-stream and --no-json cannot be used together.
es: Error: --json-stream y --no-json no pueden usarse juntas.

source: Warning: --json-translate has no effect without either --json or --json-stream.
es: Advertencia: --json-translate no tiene ningún efecto sin tener además --json o --json-stream.

source: Warning: deprecated --json-translate, use --no-raw instead.
es: Advertencia: --json-translate está obsoleta, utilice mejor --no-raw.

source: Warning: deprecated --no-json-translate, use --raw instead.
es: Advertencia: --no-json-translate está obsoleta, utilice mejor --raw.

source: Loading profile from {path}.
es: Cargando perfil desde {path}.

source: Error: invalid value for --sourceaddr4: {reason}
es: Error: valor inválido para --sourceaddr4: {reason}

source: Error: invalid value for --sourceaddr6: {reason}
es: Error: valor inválido para --sourceaddr6: {reason}

source: Error: Invalid input '{cli_arg}' in --test. There must be at most one slash ('/') character.
es: Error: entrada inválida '{cli_arg}' en --test. Debe haber al menos una barra diagonal ('/').

source: Error: Unrecognized test case '{testcase}' in --test. Use --list-tests for a list of valid choices.
es: Error: caso de prueba no reconocido '{testcase}' en --test. Use --list-tests para una lista de las alternativas válidas.

source: Error: Unrecognized test module '{module}' in --test. Use --list-tests for a list of valid choices.
es: Error: módulo de prueba no reconocido '{module}' en --test. Use --list-tests para una lista de las alternativas válidas.

source: Error: Invalid input '{cli_arg}' in --test.
es: Error: entrada inválida '{cli_arg}' en --test.

source: Notice: Engine does not have test case '{testcase}' enabled in the profile. Forcing...
es: Aviso: El motor no tiene el caso de prueba '{testcase}' habilitado en el perfil. Forzando...

source: Failed to recognize stop level '{level}'.
es: Fallo en identificar el nivel de detención '{level}'.

source: --level must be one of CRITICAL, ERROR, WARNING, NOTICE, INFO, DEBUG, DEBUG2 or DEBUG3.
es: --level debe ser alguno entre CRITICAL, ERROR, WARNING, NOTICE, INFO, DEBUG, DEBUG2 o DEBUG3.

source: Only one domain can be given for testing. Did you forget to prepend an option with '--<OPTION>'?
es: Solo puede indicarse 1 dominio para las pruebas. ¿Quizás incluyó una opción y olvidó el prefijo '--<OPCIÓN>'?

source: Must give the name of a domain to test.
es: Debe indicar el nombre de un dominio a probar.

source: Error loading hints file: {message}
es: Error al cargar el archivo 'hints': {message}

source: Seconds
es: Segundos

source: Level
es: Nivel

source: Module
es: Módulo

source: Testcase
es: Caso de prueba

source: Message
es: Mensaje

source: Looks OK.
es: Se ve bien.

source: Level Number of log entries
es: Nivel Número de registros

source: %8s %5d entries.
es: %8s %5d registros.

source: --ns must be a name or a name/ip pair.
es: --ns debe ser un nombre o un par nombre/ip.

source: --ds ds data must be in the form "keytag,algorithm,type,digest". E.g. space is not permitted anywhere in the string.
es: --ds los datos para DS deben estar en el formato "keytag,algoritmo,tipo,digest". No se permiten espacios dentro del valor.

source: DEBUG
es: DEPURACIÓN

source: NOTICE
es: AVISO

source: WARNING
es: ADVERTENCIA

source: CRITICAL
es: CRÍTICO
